{
  "name": "Niketan Rane",
  "label": "Software Engineer",
  "image_path": "img/niketan_image.png",
  "contact": {
    "email": "niketanrane05@gmail.com",
    "phone": "+917668984092",
    "location": "Bengaluru, Karnataka, India"
  },
  "summary": "AI-focused Software Engineer with 5+ years of experience specializing in Python, Django, and AI-driven development. Currently at Microsoft, working on enhancing developer productivity by integrating AI into DevOps workflows. Designed and implemented an ML-based PR reviewer recommendation system and developed an AI-powered assistant for Azure DevOps. Previously at Qualcomm, built automation frameworks for Bluetooth log analysis and optimized large-scale test systems. Passionate about leveraging AI to streamline workflows, improve efficiency, and drive intelligent automation.",
  "base_url": "nikeshot.github.io",
  "social_links": [
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/niketanrane/",
      "svg_path": "img/linkedin.svg"
    }
  ],
  "work_experience": [
    {
      "company": "Microsoft",
      "position": "Software Engineer - 2",
      "url": "https://microsoft.com",
      "start_date": "04/01/2023",
      "end_date": "Present",
      "summary": "Working on AI-driven developer productivity enhancements in Microsoft Teams and Azure DevOps.",
      "highlights": [
        "Designed and implemented an ML-based PR reviewer recommendation system to improve PR turnaround time.",
        "Integrated an AI-powered assistant into Azure DevOps using Azure OpenAI to enable contextual queries on PRs and work items."
      ]
    },
    {
      "company": "Qualcomm",
      "position": "Senior Software Engineer",
      "url": "https://www.qualcomm.com",
      "start_date": "12/01/2020",
      "end_date": "06/01/2021",
      "summary": "Worked on automation frameworks for Bluetooth log analysis and test system infrastructure.",
      "highlights": [
        "Developed a Python-based automation framework for Bluetooth end-to-end log analysis.",
        "Managed test infrastructure by commissioning machines, developing test frameworks, and building full-stack applications."
      ]
    }
  ],
  "volunteer_experience": [
    {
      "organization": "Prayaas",
      "position": "Coordinator",
      "url": "https://sample.com",
      "start_date": "01/01/2015",
      "end_date": "01/01/2017",
      "summary": "A volunteer movement by IIIT Allahabad students aimed at improving the quality of life for underprivileged kids.",
      "highlights": [
        "Led initiatives to provide education and resources to children in need.",
        "Organized community outreach programs to support underprivileged students.",
        "Collaborated with peers to expand the impact of Prayaas."
      ]
    }
  ],
  "education": [
    {
      "institution": "Indian Institute Of Information Technology, Allahabad",
      "location": "Allahabad, India",
      "url": "https://www.iiita.ac.in/",
      "degrees": [
        "Bachelor of Technology in Electronics and Communication Engineering"
      ],
      "graduation_date": "06/01/2017"
    }
  ],
  "skills": [
    {
      "name": "Python",
      "proficiency": 80,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Django",
      "proficiency": 70,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "C#",
      "proficiency": 50,
      "proficiency_label": "Beginner"
    },
    {
      "name": "Machine Learning",
      "proficiency": 85,
      "proficiency_label": "Advanced"
    },
    {
      "name": "AI",
      "proficiency": 90,
      "proficiency_label": "Advanced"
    },
    {
      "name": "DevOps",
      "proficiency": 75,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "Azure",
      "proficiency": 70,
      "proficiency_label": "Intermediate"
    }
  ],
  "interests": [
    {
      "name": "Books",
      "summary": "Enjoys reading books across various genres, including technology, AI, and fiction."
    },
    {
      "name": "Cricket",
      "summary": "Passionate about cricket, enjoys both playing and following the sport."
    }
  ],
  "languages": [
    {
      "language": "Marathi",
      "fluency": "Native"
    },
    {
      "language": "English",
      "fluency": "Full Professional"
    },
    {
      "language": "Hindi",
      "fluency": "Full Professional"
    }
  ],
  "references": [
    {
      "name": "Valerio Canova",
      "relation": "Senior Staff Engineer, Qualcomm",
      "reference": "My team operated in tandem with a complementary one in India. We both looked after a test system infrastructure: commissioning machines and instruments, developing the test framework, developing full-stack applications to manage and troubleshoot the grid. Niketan's contributions to full-stack applications have been key to success. I provided high-level requirements, he drove most of the software design, and liaised with IT and other teams to gather the necessary resources and information. He performed very well with little supervision and has all in all been a pleasure to work with."
    }
  ]
}
